;===================================
; РАЗВИВАНЕ НА ЦИКЛИТЕ
;
;  С-спецификация:
;
;  register int i;
;  double a = 3.14159265358979;
;  double x[28] = {1,2,3,4,5,6,7,8,9,10,
;                  11,12,13,14,15,16,17,18,19,20,
;                  21,22,23,24,25,26,27,28};
; 
;  for(i = 0; i < 14; i++)
;  {
;    x[i]   = x[i]   * a;
;    x[i+1] = x[i+1] * a;
;    x[i+2] = x[i+2] * a;
;    x[i+3] = x[i+3] * a;
;  }
;
;===================================
;  Вариант 3: с развиване на 4 цикъла
;  Да се изследват загубите
;  - без промяна на броя на умножителите
;  - с увеличаване на броя на умножителите
;    на четири
;===================================
	.data 0

a:	.double 3.14159265358979
x:	.double 1,2,3,4,5,6,7,8,9,10
	.double 11,12,13,14,15,16,17,18,19,20
	.double 21,22,23,24,25,26,27
xtop:	.double 28

	.text

	ld f2,a(r0)
	addi r1,r0,xtop

    ; TODO:
    
    loop:	
            ld f0,0(r1)
            multd f4,f0,f2
            sd 0(r1),f4
        
            ld f6,-8(r1)
            multd f8,f6,f2
            sd -8(r1),f8
            
            ld f10,-16(r1)
    	    multd f12,f10,f2
            sd -16(r1),f12
            
            ld f14,-24(r1)
    	    multd f16,f14,f2
            sd -24(r1),f16
        
            subi r1,r1,#32
        
	bnez r1,loop

	trap 0