;===================================
; РАЗВИВАНЕ НА ЦИКЛИТЕ
;
;  С-спецификация:
;
;  register int i;
;  double a = 3.14159265358979;
;  double x[28] = {1,2,3,4,5,6,7,8,9,10,
;                  11,12,13,14,15,16,17,18,19,20,
;                  21,22,23,24,25,26,27,28};
; 
;  for(i = 0; i < 14; i++)
;  {
;    x[i]   = x[i]   * a;
;    x[i+1] = x[i+1] * a;
;  }
;
;===================================
;  Вариант 2: с развиване на 2 цикъла и преподреждане
;  Да се изследват загубите
;===================================
	.data 0

a:	.double 3.14159265358979
x:	.double 1,2,3,4,5,6,7,8,9,10
	.double 11,12,13,14,15,16,17,18,19,20
	.double 21,22,23,24,25,26,27
xtop:	.double 28

	.text

	ld f2,a(r0)
	addi r1,r0,xtop

loop:	ld f0,0(r1)
	ld f6,-8(r1)

	multd f4,f0,f2
	multd f8,f6,f2

	sd 0(r1),f4
	sd -8(r1),f8

	subi r1,r1,#16

	bnez r1,loop

	trap 0