;===================================
; РАЗВИВАНЕ НА ЦИКЛИТЕ
;
;  С-спецификация:
;
;  register int i;
;  double a = 3.14159265358979;
;  double x[28] = {1,2,3,4,5,6,7,8,9,10,
;                  11,12,13,14,15,16,17,18,19,20,
;                  21,22,23,24,25,26,27,28};
; 
;  for(i = 0; i < 28; i++)
;    x[i] = x[i] * a;
;
;===================================
;  Вариант 1: Без развиване
;  Да се изследват загубите на конвейера
;===================================
;  РЕГИСТРИ:
;  R1 - индекс
;  F0, F1 - буфер
;  F2, F3 - a
;  F4, F5 - буфер
;===================================

	.data 0

a:	.double 3.14159265358979
x:	.double 1,2,3,4,5,6,7,8,9,10
	.double 11,12,13,14,15,16,17,18,19,20
	.double 21,22,23,24,25,26,27
xtop:	.double 28

	.text

	ld f2,a(r0)
	addi r1,r0,xtop

loop:	
    ld f0,0(r1)
	multd f4,f0,f2
	sd 0(r1),f4

	subi r1,r1,#8
	bnez r1,loop

	trap #0
