;===================================
; ИЗСЛЕДВАНЕ НА ИЗЧИСЛИТЕЛНИЯ КОНВЕЙЕР
;
; - зависимости по данни
; - "пренасочване"
;-----------------------------------
;  С-спецификация:
;-----------------------------------
;  int a,b=1,c=2;
;  int d,e=3,f=4;
;  a = b + c;
;  d = e - f;
;
;===================================
;  РЕГИСТРИ:
;  R1 - буфер за a
;  R2 - буфер за b
;  R3 - буфер за c
;  R4 - буфер за d
;  R5 - буфер за e
;  R6 - буфер за f
;===================================
	.data

a:	.space	4
b:	.word	1
c:	.word	2
d:	.space	4
e:	.word	3
f:	.word	4

	.text

    ; TODO:

	trap 0